ProjectMurzik/xiaoclaw/sdkconfig.defaults
printf '%s\n' \
  'CONFIG_IDF_TARGET="esp32p4"' \
  'CONFIG_IDF_TARGET_ESP32P4=y' \
  'CONFIG_ESP32P4_REV_MIN_0=y' \
  'CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y' \
  'CONFIG_ESPTOOLPY_FLASHMODE_DIO=y' \
  'CONFIG_SPIRAM=y' \
  'CONFIG_SPIRAM_BOOT_INIT=y' \
  'CONFIG_SPIRAM_USE_MALLOC=y' \
  'CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y' \
  'CONFIG_PARTITION_TABLE_CUSTOM=y' \
  'CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"' \
  'CONFIG_PARTITION_TABLE_OFFSET=0x10000' \
  'CONFIG_PARTITION_TABLE_MD5=y' \
  'CONFIG_BOARD_TYPE_WAVESHARE_ESP32_P4_WIFI6_TOUCH_LCD_3_4C=y' \
  'CONFIG_COMPILER_OPTIMIZATION_PERF=y' \
  'CONFIG_COMPILER_CXX_RTTI=y' \
  'CONFIG_COMPILER_CXX_EXCEPTIONS=y' \
  'CONFIG_IDF_ENV_FPGA=y' \
  'CONFIG_USE_AUDIO_PROCESSOR=n' \
  'CONFIG_ESP_SR_ENABLE=n' \
  > sdkconfig.defaults
